package com.algorithm.onlinenum;

/**
 * ////////////////////////////////////////////////////////////////////
 * //                          _ooOoo_                               //
 * //                         o8888888o                              //
 * //                         88" . "88                              //
 * //                         (| ^_^ |)                              //
 * //                         O\  =  /O                              //
 * //                      ____/`---'\____                           //
 * //                    .'  \\|     |//  `.                         //
 * //                   /  \\|||  :  |||//  \                        //
 * //                  /  _||||| -:- |||||-  \                       //
 * //                  |   | \\\  -  /// |   |                       //
 * //                  | \_|  ''\---/''  |   |                       //
 * //                  \  .-\__  `-`  ___/-. /                       //
 * //                ___`. .'  /--.--\  `. . ___                     //
 * //              ."" '<  `.___\_<|>_/___.'  >'"".                  //
 * //            | | :  `- \`.;`\ _ /`;.`/ - ` : | |                 //
 * //            \  \ `-.   \_ __\ /__ _/   .-` /  /                 //
 * //      ========`-.____`-.___\_____/___.-`____.-'========         //
 * //                           `=---='                              //
 * //      ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^        //
 * //         佛祖保佑       永无BUG     永不修改                      //
 * ////////////////////////////////////////////////////////////////////
 *
 * @author fujin
 * @version $Id: OnlineNum.java, v 0.1 2018-09-10 Exp $$
 */
public class OnlineNum {
//    求一个论坛的在线人数，假设有一个论坛，其注册ID有两亿个，每个ID从登陆到退出会向一个日志文件中记下登陆时间和退出时间，要求写一个算法统计一天中论坛的用户在线分布，取样粒度为秒。
//    一天总共有 3600*24 = 86400秒。
//    定义一个长度为86400的整数数组int delta[86400]，每个整数对应这一秒的人数变化值，可能为正也可能为负。开始时将数组元素都初始化为0。
//    然后依次读入每个用户的登录时间和退出时间，将与登录时间对应的整数值加1，将与退出时间对应的整数值减1。
//    这样处理一遍后数组中存储了每秒中的人数变化情况。
//    定义另外一个长度为86400的整数数组int online_num[86400]，每个整数对应这一秒的论坛在线人数。
//    假设一天开始时论坛在线人数为0，则第1秒的人数online_num[0] = delta[0]。第n+1秒的人数online_num[n] = online_num[n-1] + delta[n]。
//    这样我们就获得了一天中任意时间的在线人数。

    private static int delta[] = new int[86400];
    private static int onlineNum[] = new int[86400];

    public static void main(String[] args) {
        //初始化为0，无动静
        delta[0] = 0;
        onlineNum[0] = delta[0];
        //无动静
        delta[1] = 0;
        onlineNum[1] = onlineNum[0] + delta[1];
        //00：02 进入一个人
        delta[2] = 1;
        onlineNum[2] = onlineNum[1] + delta[2];
        //00：03 进入五个人，走了一个人
        delta[3] = 4;
        onlineNum[3] = onlineNum[2] + delta[3];

        System.out.println(onlineNum[0]);
        System.out.println(onlineNum[1]);
        System.out.println(onlineNum[2]);
        System.out.println(onlineNum[3]);
    }

}
