package com.java.binary;

public class BinaryDemo {

    public static void main(String[] args) {
        /**
         * 位运算
         *
         *  1、位与  &
         *      运算规则：0&0=0  0&1=0  1&0=0  1&1=1
         *      清零： a & (0000 0000)  ->   0000 0000
         *      取一个数的指定位 取X低4位 X=1010 1110   Y=0000 1111   X&Y=0000 1110
         *      判断奇偶   a & 1   0就是偶数，1就是奇数
         *  2、位或   |
         *      运算规则：0|0=0  0|1=1  1|0=1  1|1=1
         *      常用来对一个数据的某些位设置为1   X=1010 1110 的低4位设置为1    Y=0000 1111    X|Y=1010 1111
         *  3、位异或   ^
         *      运算规则：0^0=0  0^1=1  1^0=1  1^1=0
         *      翻转指定位     X=1010 1110 的低4位进行翻转   Y=0000 1111     X^Y=1010 0001
         *      与0相异或值不变    1010 1110 ^ 0000 0000 = 1010 1110
         *  4、取反     ~
         *      运算规则：~1=0   ~0=1
         *      使一个数的最低位为零   使a的最低位为0，可以表示为：a & ~1
         */


        System.out.println(1 & 14);  //判断奇偶    0就是偶数，1就是奇数
//        byte X = 10101110;
        System.out.println(12 & 15);
        System.out.println(12 & 11);
    }
}
